############################################################
f1 = open("C:/Python/새파일.txt",'w') #쓰기모드로 새파일 생성

for i in range(1, 11): 
  data = "%d번째 줄입니다.\n" %i
  f1.write(data) #data를 파일 객체 f에 써라
 
 f1.close() #파일 닫기
 ###########################################################
 
 ###########################################################
 f2 = open("C:/Python/새파일.txt",'r')  #읽기모드로 파일 불러오기
 
 while True:
  line = f2.readline() # 이 문장 하나만 있으면 한 줄만 출력
  if not line: break
  print(line)

f2.close()
###########################################################
f3 = openn("C:/Python/새파일.txt",'a') #추가 모드로 파일 불러오기

for i in range(11,20):  ##11부터 19까지 
  data = "%d번째 줄입니다.\n" %i
  f3.write(data)

f3.close()
###########################################################

###########################################################

###########################################################
#이렇게 작성하면 with 블록을 벗어나는 순간 파일이 자동으로 close 된다
with open("foo.txt", "w")as f4:
  f4.write("Life is too short. You need python".)
###########################################################
