/*///////////////////////////////////////////
1. LEDs의 초기값을 이진수로 00000001을 대입
2. LEDs 값을 왼쪽으로 1만큼 계속 shift
3. LEDs 값이 이진수로 10000000 으로 대입되었을 때
4. 역으로 오른쪽으로 1만큼 계속 shift
5. 위의 과정이 4번 반복
//////////////////////////////////////////*/

#include <stdio.h>
#include <stdlib.h>

void LED_function() {
	
	unsigned char LEDs = 00000001;
	for (int i = 0; i < 7; i++) {
		printf("%d ", LEDs);
		LEDs = LEDs << 1;
	}
	for (int i = 0; i < 7; i++) {
		printf("%d ", LEDs);
		LEDs = LEDs >> 1;
	}
	printf("%d\n", LEDs);
}

int main() {

	for (int i = 0; i < 4; i++) {
		LED_function();
	}

}

/*///////////////////////////////////////

output :

1 2 4 8 16 32 64 128 64 32 16 8 4 2 1
1 2 4 8 16 32 64 128 64 32 16 8 4 2 1
1 2 4 8 16 32 64 128 64 32 16 8 4 2 1
1 2 4 8 16 32 64 128 64 32 16 8 4 2 1

///////////////////////////////////////*/
